# coding=utf-8

'''
Домашнее задание + задача на занятия одновременно 10

Реализовать в Python­коде модель предметной области из предыдущего домашнего
задания. Добавить в модель несколько разновидностей игроков:
обычный игрок,
модератор игры,
администратор игры.
Игроки типа модератор и администратор будут иметь в будущем дополнительные игровые возможности.
Игроков различных типов следует представить в виде иерархии родственных классов.
Также следует продумать возможное поведение таких игроков и реализовать 1­2 полиморфных демо­метода.
Логику работы предметной области реализовать минимально возможную, везде, где это
возможно, следует обойтись вызовом функции print в сочетании с понятной текстовой
строкой.
'''

